# Pandas Textbook for Digital Humanities

## Chapter Two: The Basics of Pandas

## Covered in this Chapter

1) How to Create a DataFrame from a Dictionary<br>
2) How to Display a DataFrame<br>
3) How to Save a DataFrame to CSV<br>
4) How to Create a DataFrame from a CSV File<br>
5) How to Create a DataFrame from a JSON File<br>
6) How to Add a Column to a DataFrame<br>
7) How to Grab a Specific Column of a DataFrame<br>
8) How to Convert a Column to a List<br>
9) How to Grab a Specific Row of a DataFrame

## How to Create a DataFrame from a Dictionary

In [1]:
import pandas as pd

In [2]:
names_dict = {"names":
        [
            "Tom",
            "Mary",
            "Jeff",
            "Rose",
            "Stephanie",
            "Rodger"
        ]}

In [18]:
df = pd.DataFrame(names_dict)

## How to Display a DataFrame

In [19]:
df

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

## How to Save DataFrame to CSV

In [21]:
df.to_csv("data/names.csv")

## How to Read DataFrame from CSV

In [22]:
df2 = pd.read_csv("data/names.csv")

In [23]:
df2

   Unnamed: 0      names
0           0        Tom
1           1       Mary
2           2       Jeff
3           3       Rose
4           4  Stephanie
5           5     Rodger

In [24]:
df.to_csv("data/names_no_index.csv", index=False)

In [25]:
df3 = pd.read_csv("data/names_no_index.csv")

In [26]:
df3

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

## How to Save DataFrame to JSON

In [28]:
df3.to_json("data/names.json")

In [31]:
df4 = pd.read_json("data/names.json")

In [32]:
df4

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

## How to Add a Column to the DataFrame

In [33]:
df4["ages"] = [20, 26, 20, 18, 52, 40]

In [34]:
df4

       names  ages
0        Tom    20
1       Mary    26
2       Jeff    20
3       Rose    18
4  Stephanie    52
5     Rodger    40

## How to Grab a Specific Column

In [38]:
names = df4.names

In [39]:
print (names)

0          Tom
1         Mary
2         Jeff
3         Rose
4    Stephanie
5       Rodger
Name: names, dtype: object

In [40]:
ages = df4.ages

In [41]:
ages

0    20
1    26
2    20
3    18
4    52
5    40
Name: ages, dtype: int64

## How to Convert a Column to a List

In [42]:
ages_list = df4.ages.tolist()

In [43]:
print (ages_list)

[20, 26, 20, 18, 52, 40]

How to Grab a Specific Row of a DataFrame